In [39]:
import pandas as pd

In [40]:
forum_users = {
    'UserID': [1, 2, 3, 4, 5],
    'Username': ['jane_smith', 'alex123', 'bob56', 'mark_wilson', 'test_name'],
    'Age': [18, 35, 25, 28, None],
    'Joined Date': ['2034-01-01', '2034-02-15', '2034-04-25', '2034-06-21', '2034-09-15'],
    'Total Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 500]
}

df = pd.DataFrame(forum_users)
df

   UserID     Username   Age Joined Date  Total Posts  Reputation
0       1   jane_smith  18.0  2034-01-01          150         500
1       2      alex123  35.0  2034-02-15          230         720
2       3        bob56  25.0  2034-04-25           80         200
3       4  mark_wilson  28.0  2034-06-21          420         940
4       5    test_name   NaN  2034-09-15          310         500

In [41]:
type(df)

pandas.core.frame.DataFrame

In [42]:
df.columns

Index(['UserID', 'Username', 'Age', 'Joined Date', 'Total Posts',
       'Reputation'],
      dtype='object')

In [43]:
df.columns.tolist()

['UserID', 'Username', 'Age', 'Joined Date', 'Total Posts', 'Reputation']

In [44]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [45]:
df.index.tolist()

[0, 1, 2, 3, 4]

In [46]:
df.dtypes

UserID           int64
Username        object
Age            float64
Joined Date     object
Total Posts      int64
Reputation       int64
dtype: object

In [47]:
df.values

array([[1, 'jane_smith', 18.0, '2034-01-01', 150, 500],
       [2, 'alex123', 35.0, '2034-02-15', 230, 720],
       [3, 'bob56', 25.0, '2034-04-25', 80, 200],
       [4, 'mark_wilson', 28.0, '2034-06-21', 420, 940],
       [5, 'test_name', nan, '2034-09-15', 310, 500]], dtype=object)

In [48]:
type(df.values)

numpy.ndarray

In [49]:
df.head(3)

   UserID    Username   Age Joined Date  Total Posts  Reputation
0       1  jane_smith  18.0  2034-01-01          150         500
1       2     alex123  35.0  2034-02-15          230         720
2       3       bob56  25.0  2034-04-25           80         200

In [50]:
df.values[1, 1]

'alex123'

In [51]:
df.tail(2)

   UserID     Username   Age Joined Date  Total Posts  Reputation
3       4  mark_wilson  28.0  2034-06-21          420         940
4       5    test_name   NaN  2034-09-15          310         500

In [52]:
df.describe().round(2)

       UserID    Age  Total Posts  Reputation
count    5.00   4.00          5.0        5.00
mean     3.00  26.50        238.0      572.00
std      1.58   7.05        133.3      276.62
min      1.00  18.00         80.0      200.00
25%      2.00  23.25        150.0      500.00
50%      3.00  26.50        230.0      500.00
75%      4.00  29.75        310.0      720.00
max      5.00  35.00        420.0      940.00

In [53]:
df.select_dtypes(include='object')

      Username Joined Date
0   jane_smith  2034-01-01
1      alex123  2034-02-15
2        bob56  2034-04-25
3  mark_wilson  2034-06-21
4    test_name  2034-09-15

In [54]:
df.select_dtypes(include='object').columns

Index(['Username', 'Joined Date'], dtype='object')

In [55]:
df.select_dtypes(include='int64')

   UserID  Total Posts  Reputation
0       1          150         500
1       2          230         720
2       3           80         200
3       4          420         940
4       5          310         500

In [58]:
df.isna()

   UserID  Username    Age  Joined Date  Total Posts  Reputation
0   False     False  False        False        False       False
1   False     False  False        False        False       False
2   False     False  False        False        False       False
3   False     False  False        False        False       False
4   False     False   True        False        False       False

In [59]:
df.isna().sum()

UserID         0
Username       0
Age            1
Joined Date    0
Total Posts    0
Reputation     0
dtype: int64